[{
  "title": "Tooling Up",
  "slug": "tooling-up",
  "author": "Amber Bravo",
  "date": "June 14 2015",
  "primaryColor": "#5a7785",
  "secondaryColor": "#455a64",
  "image": "images/tooling-up.svg",
  "desc": "How a new generation of prototyping tools at Google will help designers build better software.",
  "content": "The road from design to production is often hard-won, filled with well-intended design detours, steep learning curves, and the occasional road block. Here’s a common scenario: A team of designers begins building wireframes for a new product. Several weeks, revisions, and pin-ups later, they emerge with a “final,” “shippable” file, which they hand off to the development team. The engineers poke holes in the design, deeming several elements “unbuildable,” and begin rendering out some semblance of the design in code. Several weeks later, they deliver a staging site. The designers are thrilled—this is the first time they’ve seen their design IRL—but are quickly deflated when they realize how much of the design has been lost in translation. The typography is wonky. The animations and interactive elements need to be re-tuned. A volley of annotated emails with screenshots ensues, until finally, the designer and developer sit side-by-side, and visually adjust the design directly in code."
}, {
  "title": "Expressing Brand in Material",
  "author": "Viktor Persson & Rachel Been",
  "date": "July 4 2015",
  "primaryColor": "#202226",
  "secondaryColor": "#333",
  "image": "images/expressing-brand.svg",
  "desc": "Material design offers a system for designing functional and elegant software. How does your brand fit into the framework? We’ve created a step-by-step guide to staying on-brand while going material.",
  "content": "Nobody knows your brand better than you do. This is why when we set out to create the framework for material design, we were sensitive to the ways in which third-party developers might leverage the system. We wanted material design to give comprehensive guidance for designing effective and elegant UIs — taking a strong position on motion, dimensionality, color, and graphic hierarchy — but with enough latitude to allow for various levels of engagement. You don’t have to adopt every element of the material design system in order for it to be beneficial to your identity system. Whether it’s a custom font, a unique color story, or distinct voice, everything that provides stylistic distinction in a product should be celebrated and supported in the material design framework. We’ve laid out the top brand touchpoints to help illustrate the system’s flexibility and give designers and developers a road map for showcasing their brand identity."
}, {
  "title": "New Design Tools",
  "author": "Amber Bravo",
  "date": "July 29 2015",
  "primaryColor": "#3e50b4",
  "secondaryColor": "#303fc3",
  "image": "images/new-design-tools.svg",
  "desc": "See Also: (More) thoughts on design tools",
  "content": "This week on Google Design, we published a roundtable discussion with Matias Duarte and the founders of Pixate and RelativeWave, Paul Colton and Max Wiesel. To prepare for the interview, I turned to my design brethren on Medium (and beyond!) to learn more about their experiences working with some of the more popular prototyping tools available today, as well as their hopes and dreams for the next generation of design software. Here are a few of the stories I found helpful for framing the discussion. A thorough account of using Form (pre 1.3) for the first time, from the perspective of a designer who is less familiar with Quarz Composer, with built prototypes to help synthesize the material covered in each section. Also worth reading: Ces’ great tutorial exploring material design in Origami."
}]
